package chapter02

/**
 * 128：Int类型，占据4个字节，32位
 * 原码：0000 0000 0000 0000 0000 0000 1000 0000
 * 补码：0000 0000 0000 0000 0000 0000 1000 0000
 *
 * 截取最后一个字节，Byte
 * 得到补码，1000 0000：-128(前面的1是符号位)
 * 表示最大的负数 -128
 *
 * 130：Int类型，占据4个字节，32位
 * 原码：0000 0000 0000 0000 0000 0000 1000 0010
 * 补码：0000 0000 0000 0000 0000 0000 1000 0010
 *
 * 截取最后一个字节，Byte
 * 得到补码，1000 0010：-126(前面的1是符号位)
 * 表示的负数 -128 + 2 = -126
 * 对应的原码：1111 1110 -> +126
 */
object Test09_Problem_DataTypeConversion {
  def main(args: Array[String]): Unit = {
    // 补码表示，截取最后一个字节
    val n: Int = 130
    val b: Byte = n.toByte
    // -126
    println(b)
  }
}
